{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20], "sparse": false, "input_dtype": "int32", "name": "word_inputs"}, "name": "word_inputs"}, {"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20], "sparse": false, "input_dtype": "int32", "name": "predicate_inputs"}, "name": "predicate_inputs"}, {"class_name": "Embedding", "inbound_nodes": [[["word_inputs", 0, 0]], [["predicate_inputs", 0, 0]]], "config": {"input_length": 20, "W_constraint": null, "name": "embedding_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "batch_input_shape": [null, 20], "W_regularizer": null, "dropout": 0.1, "input_dim": 400001, "output_dim": 50}, "name": "embedding_1"}, {"class_name": "Merge", "inbound_nodes": [[["embedding_1", 0, 0], ["embedding_1", 1, 0]]], "config": {"name": "merge_1", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "mode": "concat"}, "name": "merge_1"}, {"class_name": "Bidirectional", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "forward_lstm_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 100, "forget_bias_init": "one", "output_dim": 128}}, "trainable": true, "name": "bidirectional_3"}, "name": "bidirectional_3"}, {"class_name": "Bidirectional", "inbound_nodes": [[["bidirectional_3", 0, 0]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "forward_lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 256, "forget_bias_init": "one", "output_dim": 128}}, "trainable": true, "name": "bidirectional_2"}, "name": "bidirectional_2"}, {"class_name": "Bidirectional", "inbound_nodes": [[["bidirectional_2", 0, 0]]], "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "input_length": null, "name": "forward_lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "init": "glorot_uniform", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 256, "forget_bias_init": "one", "output_dim": 128}}, "trainable": true, "name": "bidirectional_1"}, "name": "bidirectional_1"}, {"class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0]]], "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_4"}, "name": "timedistributed_4"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["timedistributed_4", 0, 0]]], "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_3"}, "name": "timedistributed_3"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["timedistributed_3", 0, 0]]], "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_2"}, "name": "timedistributed_2"}, {"class_name": "TimeDistributed", "inbound_nodes": [[["timedistributed_2", 0, 0]]], "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 22}}, "trainable": true, "name": "timedistributed_1"}, "name": "timedistributed_1"}], "input_layers": [["word_inputs", 0, 0], ["predicate_inputs", 0, 0]], "name": "model_1", "output_layers": [["timedistributed_1", 0, 0]]}, "rnn": {"embedding_size": 50, "sent_maxlen": 20, "emb_dropout": 0.1, "batch_size": 50, "epochs": 1, "seed": 42, "num_of_latent_layers": 3, "pred_dropout": 0.1, "trainable_emb": true, "hidden_units": 128, "emb": null, "sep": "\t", "classes": null}}