{"class_name": "Model", "keras_version": "1.2.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "input_dtype": "int32", "sparse": false, "name": "word_inputs"}, "inbound_nodes": [], "name": "word_inputs"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "input_dtype": "int32", "sparse": false, "name": "predicate_inputs"}, "inbound_nodes": [], "name": "predicate_inputs"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 400001, "batch_input_shape": [null, 20], "W_regularizer": null, "dropout": 0.1, "output_dim": 50, "input_length": 20}, "inbound_nodes": [[["word_inputs", 0, 0]], [["predicate_inputs", 0, 0]]], "name": "embedding_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["embedding_1", 0, 0], ["embedding_1", 1, 0]]], "name": "merge_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_3", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 100, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_3"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "bidirectional_3"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_2"}, "inbound_nodes": [[["bidirectional_3", 0, 0]]], "name": "bidirectional_2"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "input_dim": 256, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["bidirectional_2", 0, 0]]], "name": "bidirectional_1"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["bidirectional_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 256, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_4"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "timedistributed_4"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_3"}, "inbound_nodes": [[["timedistributed_4", 0, 0]]], "name": "timedistributed_3"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1028}}, "trainable": true, "name": "timedistributed_2"}, "inbound_nodes": [[["timedistributed_3", 0, 0]]], "name": "timedistributed_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 1028, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 22}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["timedistributed_2", 0, 0]]], "name": "timedistributed_1"}], "input_layers": [["word_inputs", 0, 0], ["predicate_inputs", 0, 0]], "output_layers": [["timedistributed_1", 0, 0]], "name": "model_1"}}